app/controllers/posts_controller.rb

	def index
		@posts = Post.all.order('created_at desc').paginate(page: params[:page], :per_page => 5)
---
SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

	def create
		@post = Post.new post_params # permits title and content
		if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)

	def update
		if @post.update post_params
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?

	def find_post
		@post = Post.friendly.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]