app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" ORDER BY created_at desc
---
	def index
		@projects  = Project.all.order('created_at desc')

INSERT INTO "projects" ("title", "description", "link", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Deleted"], ["description", "dsfsddf"], ["link", ""], ["created_at", 2016-11-26 16:56:25 UTC], ["updated_at", 2016-11-26 16:56:25 UTC], ["slug", "deleted"]]
---
	def create
		@project = Project.new project_params
		if @project.save

UPDATE "projects" SET "link" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["link", "http://www.apropos-agency.com/"], ["updated_at", 2016-11-26 16:54:52 UTC], ["id", 1]]
---
	def update
		if @project.update project_params

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def find_project
		@project = Project.friendly.find(params[:id])